**Definiowanie bazy**

In [92]:
CREATE DATABASE Wypozyczalnia

In [93]:
USE Wypozyczalnia

CREATE TABLE Dane_adresowe   
(  
	id_adres int primary key,
	miasto varchar(20),
	ulica varchar(40),
	numer_budynku varchar(10),
	numer_lokalu varchar(10)
);

INSERT INTO Dane_adresowe(
	id_adres,
	miasto,
	ulica ,
	numer_budynku,
	numer_lokalu
	)
VALUES
	('1','Warszawa','Niepodleglosci','132','55'),
	('2','Janki','Jasna','2','3'),
	('3','Warszawa','Wybickiego','333','222'),
	('4','Legionowo','Sienkiewicza','34','67'),
	('5','Marki','Wajdy','3','546'),
	('6','Warszawa','Prosta','2','55'),
	('7','Warszawa','Krzywa','12','1'),
	('8','Warszawa','Zielona','555','32');
;
CREATE TABLE Klient 
(  
	id_klienta int primary key,
    imie varchar(50) NOT NULL  ,
	nazwisko varchar(50) NOT NULL ,
	data_urodzenia date  NOT NULL ,
	telefon float  NOT NULL ,
	adres int FOREIGN KEY REFERENCES Dane_adresowe(id_adres)  NOT NULL ,
	zamowienia int NULL,
	numer_dowodu varchar(9) NOT NULL
	
);

INSERT INTO Klient(id_klienta, imie, nazwisko,data_urodzenia ,telefon ,adres,zamowienia,numer_dowodu)
VALUES
	('1','Marek','Ostrowski','1989-01-02','444555666','5','2','KUZ698226'),
	('2','Milena','Sawicka','1992-05-01','666444222','4','4','YKU517586'),
	('3','Jakub','Baranowski','1983-10-15','777888999','3',NULL,'SWW980885')	;

CREATE TABLE Zatrudnienie
(	id_zatrudnienia int primary key NOT NULL,
	data_rozpoczecia date NOT NULL,
	data_zakonczenia date NULL ,
	pensja float NOT NULL,
	zaczyna TIME(0) NOT NULL,
    konczy TIME(0)  NOT NULL, 
	placowka int FOREIGN KEY REFERENCES Dane_adresowe(id_adres)  NOT NULL ,
	pracujace_weekendy TINYINT NULL,
	stanowisko varchar(20) NOT NULL,
);

INSERT INTO Zatrudnienie(id_zatrudnienia,data_rozpoczecia, data_zakonczenia,pensja ,zaczyna ,konczy,placowka, pracujace_weekendy,stanowisko)
VALUES
	('1','2010-01-02','2020-01-02','3333','8:00','16:00','1','2','Sprzedawca'),
	('2','2010-01-02',NULL,'3750','7:00','15:00','1','2','Sprzedawca'),
	('3','2011-02-04',NULL,'4500','8:00','16:00','2','0','Sprzedawca');

CREATE TABLE Pracownik  
(  
	id_pracownika int primary key,
    imie varchar(50) NOT NULL  ,
	nazwisko varchar(50) NOT NULL ,
	data_urodzenia date,
	zatrudnienie int FOREIGN KEY REFERENCES Zatrudnienie(id_zatrudnienia) ,
	adres int FOREIGN KEY REFERENCES Dane_adresowe(id_adres) 
);


INSERT INTO Pracownik(id_pracownika, imie, nazwisko,data_urodzenia ,zatrudnienie ,adres)
VALUES
	('1','Kajetan','Chmielewski','1990-01-02','2','6'),
	('2','Denis','Sawicki','1969-03-01','1','8'),
	('3','Radoslaw','Makowski','1987-11-14','3','7')	;


CREATE TABLE Samochod
(  
	id_samochodu int primary key NOT NULL,
	marka varchar(20) NOT NULL,
	model VARCHAR(20) NULL ,
	status_car BIT NOT NULL,
	numer_rejestracyjny varchar(8) NULL,
    koszt_za_dzien smallint NOT NULL, 
	placowka int FOREIGN KEY REFERENCES Dane_adresowe(id_adres) NOT NULL,
	liczba_zamowien int NULL,
	miejsca tinyint NOT NULL,
);

INSERT INTO Samochod(id_samochodu, marka, model, status_car, numer_rejestracyjny,koszt_za_dzien,placowka,liczba_zamowien,miejsca)
VALUES
	('1','Volkswagen','Golf','1','WE74281','200','1','5','5'),
	('2','Opel','Insignia','1','WE74213','250','2',NULL,'5'),
	('3','Toyota','Avensis','0','WE23281','400','1','2','5'),
	('4','Skoda','Octavia','1','WE74281','350','1','10','5');

CREATE TABLE Platnosc
(  
	id_platnosci int primary key NOT NULL,
	status_platnosci bit NOT NULL,
	kwota int NOT NULL,
	data_platnosci date NULL,
);

INSERT INTO Platnosc(id_platnosci, status_platnosci,kwota,data_platnosci)
VALUES
	('1','1','1000','2022-01-02'),
	('2','1','2400','2022-04-02'),
	('3','0','1700',NULL),
	('4','0','1000',NULL);

CREATE TABLE Zamowienie
(  
	id_zamowienia int primary key NOT NULL,
	id_klienta int FOREIGN KEY REFERENCES Klient(id_klienta)  NOT NULL,
	id_samochodu int FOREIGN KEY REFERENCES Samochod(id_samochodu)  NOT NULL,
	data_zakonczenia date NOT NULL ,
	data_rozpoczecia date NOT NULL ,
	id_pracownika int NOT NULL,
	miejsce_odbioru int FOREIGN KEY REFERENCES Dane_adresowe(id_adres)  NOT NULL,
	miejsce_oddania int FOREIGN KEY REFERENCES Dane_adresowe(id_adres)  NOT NULL,
    id_platnosci int FOREIGN KEY REFERENCES Platnosc(id_platnosci) NOT NULL,
);

INSERT INTO Zamowienie(id_zamowienia, id_klienta, id_samochodu,data_zakonczenia,data_rozpoczecia,id_pracownika,miejsce_odbioru,miejsce_oddania,id_platnosci)
VALUES
	('1','1','3','2022-04-08','2022-04-02','3','1','1','2'),
	('2','2','1','2022-05-08','2022-05-02','1','2','1','1'),
	('3','1','3','2022-07-08','2022-07-02','1','1','2','3'),
	('4','1','3','2022-09-07','2022-09-01','1','1','2','4');

**Wyświetl dostępne samochody w kolejności od najtańszego**

In [94]:
USE Wypozyczalnia
SELECT *
FROM Samochod 
WHERE status_car <> 0 
ORDER BY koszt_za_dzien

id_samochodu,marka,model,status_car,numer_rejestracyjny,koszt_za_dzien,placowka,liczba_zamowien,miejsca
1,Volkswagen,Golf,1,WE74281,200,1,5,5
2,Opel,Insignia,1,WE74213,250,2,NULL,5
4,Skoda,Octavia,1,WE74281,350,1,10,5

**Wyszukanie Imienia i nazwiska osoby z zamówienia numer 2**

In [95]:
SELECT K.imie, K.nazwisko
FROM Klient K
INNER JOIN Zamowienie Z ON Z.id_klienta = K.id_klienta
WHERE id_zamowienia = '2'

imie,nazwisko
Milena,Sawicka

**Wyszukanie imienia, nazwiska i daty rozwiązania umowy pracowników , którzy zakończyli pracę**

In [96]:
SELECT P.imie, P.nazwisko, Z.data_zakonczenia
FROM Pracownik P
INNER JOIN Zatrudnienie Z ON Z.id_zatrudnienia = P.zatrudnienie
WHERE data_zakonczenia IS NOT NULL

imie,nazwisko,data_zakonczenia
Denis,Sawicki,2020-01-02

**Wyświetl zaległości klientów w płatnościach**

In [97]:
SELECT
   CONCAT_WS(' ', k.Imie, k.Nazwisko) AS 'Klient', 
   SUM(p.kwota) AS 'Do zapłaty' 
FROM 
    Platnosc AS p
    JOIN
    Zamowienie AS z ON p.id_platnosci = z.id_platnosci AND p.status_platnosci = 0
    JOIN
    Klient  AS k ON k.id_klienta = z.id_klienta

GROUP BY k.Imie , k.Nazwisko;

Klient,Do zapłaty
Marek Ostrowski,2700

**Wyświetl adresy placówek, w których można wypożyczyć samochód**

In [98]:

SELECT DISTINCT A.miasto, A.ulica, A.numer_budynku, A.numer_lokalu
FROM Dane_adresowe A
INNER JOIN Samochod S ON S.placowka = A.id_adres

miasto,ulica,numer_budynku,numer_lokalu
Janki,Jasna,2,3
Warszawa,Niepodleglosci,132,55